app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn"], ["created_by", "1"], ["created_at", "2017-08-22 14:01:55.852597"], ["updated_at", "2017-08-22 14:01:55.852597"]]
---
  def create
    @todo = Todo.create!(todo_params)

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Shopping"], ["updated_at", "2017-08-22 14:01:13.184175"], ["id", 1]]
---
  def update
    @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy
    @todo.destroy